mbarbeau0545/Stm32TemplateProject/src/1_FMK/FMK_CFG/FMKCFG_ConfigFiles/FMKCPU_ConfigPublic.h
/*********************************************************************
 * @file        FMKCPU_ConfigPublic.h
 * @brief       Template_BriefDescription.
 * @note        TemplateDetailsDescription.\n
 *
 * @author      mba
 * @date        31/08/2024
 * @version     1.0
 */
  
#ifndef FMKCPU_CONFIGPUBLIC_H_INCLUDED
#define FMKCPU_CONFIGPUBLIC_H_INCLUDED





    // ********************************************************************
    // *                      Includes
    // ********************************************************************
    /* CAUTION : Automatic generated code section for CPU Configuration: Start */
    #include "stm32g4xx_hal.h"
    #include "stm32g4xx.h"
    /* CAUTION : Automatic generated code section for CPU Configuration: End */
    #include "TypeCommon.h"
    #include "Constant.h"
    // ********************************************************************
    // *                      Defines
    // ********************************************************************
    /* CAUTION : Automatic generated code section for Ecu Family: Start */
    #define FMKCPU_STM32_ECU_FAMILY_G4
    /* CAUTION : Automatic generated code section for Ecu Family: End */


    
    #define FMKCPU_WWDG_RESET_CFG  FMKCPU_WWDG_RESET_100MS /**< default watchdogs configuration */

    #define FMKCPU_ADC_DMA_MODE             (DMA_CIRCULAR)      /**< DMA Mode for adc's */
    #define FMKCPU_UART_RX_DMA_MODE         (DMA_CIRCULAR)        /**< DMA Mode Uart for Rx */
    #define FMKCPU_UART_TX_DMA_MODE         (DMA_NORMAL)      /**< DMA Mode Uart for Tx */
    #define FMKCPU_USART_RX_DMA_MODE        (DMA_CIRCULAR)      /**< DMA Mode Uart for Rx */
    #define FMKCPU_USART_TX_DMA_MODE        (DMA_NORMAL)      /**< DMA Mode Uart for Tx */
    #define FMKCPU_TIM_CHNL_ECDR_CC1_MODE   (DMA_CIRCULAR)
    #define FMKCPU_TIM_CHNL_ECDR_CC2_MODE   (DMA_CIRCULAR)

    // ********************************************************************
    // *                      Types
    // ********************************************************************
    /**< Clock Core System Frequency Speed */
    typedef enum
    {
#if defined(FMKCPU_STM32_ECU_FAMILY_G4)
        FMKCPU_CORE_CLOCK_SPEED_8MHZ = 0x0U,    /**< Core CLock Speed Run at 8Mhz */
        FMKCPU_CORE_CLOCK_SPEED_16MHZ,          /**< Core CLock Speed Run at 16Mhz */
        FMKCPU_CORE_CLOCK_SPEED_32MHZ,          /**< Core CLock Speed Run at 32Mhz */
        FMKCPU_CORE_CLOCK_SPEED_40MHZ,          /**< Core CLock Speed Run at 40Mhz */
        FMKCPU_CORE_CLOCK_SPEED_48MHZ,          /**< Core CLock Speed Run at 48Mhz */
        FMKCPU_CORE_CLOCK_SPEED_64MHZ,          /**< Core CLock Speed Run at 64Mhz */
        FMKCPU_CORE_CLOCK_SPEED_80MHZ,          /**< Core CLock Speed Run at 80Mhz */
        FMKCPU_CORE_CLOCK_SPEED_96MHZ,          /**< Core CLock Speed Run at 96Mhz */
        FMKCPU_CORE_CLOCK_SPEED_128MHZ,         /**< Core CLock Speed Run at 132Mhz */
        FMKCPU_CORE_CLOCK_SPEED_160MHZ,         /**< Core CLock Speed Run at 160Mhz */
#elif defined(FMKCPU_STM32_ECU_FAMILY_H7)
        FMKCPU_CORE_CLOCK_SPEED_100MHZ = 0U,     /** Core Clock Speed Run at 100 MHz */
        FMKCPU_CORE_CLOCK_SPEED_200MHZ,          /** Core Clock Speed Run at 200 MHz */
        FMKCPU_CORE_CLOCK_SPEED_400MHZ,          /** Core Clock Speed Run at 400 MHz */
        FMKCPU_CORE_CLOCK_SPEED_480MHZ,          /** Core Clock Speed Run at 480 MHz */
#endif

        FMKCPU_CORE_CLOCK_SPEED_NB,                  /**< Core CLock Speed Run Number */
        FMKCPU_CORE_CLOCK_SPEED_UNKNOWN,             /**< Core CLock Speed Run Number */
    } t_eFMKCPU_CoreClockSpeed;

    /**< Enum for NVIC priority */
    typedef enum 
    {
        FMKCPU_NVIC_PRIORITY_LOW = 0x0U,    /**< Reference to bsp priority low value */
        FMKCPU_NVIC_PRIORITY_MEDIUM,        /**< Reference to bsp priority medium value */
        FMKCPU_NVIC_PRIORITY_HIGH,          /**< Reference to bsp priority high value */

        FMKCPU_NVIC_PRIORITY_NB             /**< Number of reference to bsp priority */
    } t_eFMKCPU_NVICPriority;

    
    /**< Enum for watchdog timer list */
    typedef enum
    {
        FMKCPU_WWDG_RESET_50MS = 0,     /**< Watchdogs reset parameter is 50 ms */
        FMKCPU_WWDG_RESET_100MS,        /**< Watchdogs reset parameter is 100 ms */
        FMKCPU_WWDG_RESET_200MS,        /**< Watchdogs reset parameter is 200 ms */
        FMKCPU_WWDG_RESET_500MS,        /**< Watchdogs reset parameter is 500 ms */

        FMKCPU_WWDG_RESET_NB,           /**< Number of watchdogs reset parameter  */
    } t_eFMKCPu_WwdgResetPeriod;


    typedef enum 
    {
        FMKCPU_DMA_TYPE_ADC = 0x00,
        FMKCPU_DMA_TYPE_UART_RX,
        FMKCPU_DMA_TYPE_UART_TX,
        FMKCPU_DMA_TYPE_USART_RX,
        FMKCPU_DMA_TYPE_USART_TX,
        FMKCPU_DMA_TYPE_SPI,
        FMKCMAC_DMA_TYPE_TIM_CHNL_ECDR_CC1,
        FMKCMAC_DMA_TYPE_TIM_CHNL_ECDR_CC2,

        FMKCPU_DMA_TYPE_NB,

    } t_eFMKCPU_DmaType;


    /**< Reference to Dma Priority */
    typedef enum
    {
        FMKCPU_DMA_TRANSPRIO_LOW = 0x0U,
        FMKCPU_DMA_TRANSPRIO_MEDIUM,
        FMKCPU_DMA_TRANSPRIO_HIGH,
        FMKCPU_DMA_TRANSPRIO_VERY_HIGH,

        FMKCPU_DMA_TRANSPRIO_NB,
    } t_eFMKCPU_DmaTransferPriority;

    /**< Reference for Dma Transfer Direction */
    typedef enum
    {
        FMKCPU_DMA_TRANSDIR_MEM_TO_MEM = 0x0U,
        FMKCPU_DMA_TRANSDIR_PERIPH_TO_MEM,
        FMKCPU_DMA_TRANSDIR_MEM_TO_PERIPH,

        FMKCPU_DMA_TRANSDIR_NB
    } t_eFMKCPU_DmaTransferDir;

    ///@brief diagnostic to determine the cause of a reset on cpu 
    typedef enum 
    {
        FMKCPU_RESET_CAUSE_NONE = 0,      /*!< No reset flags are active (or flags have been manually cleared) */

        FMKCPU_RESET_CAUSE_OBLRST,        /*!< Reset caused by Option Bytes reconfiguration (OBL reset).
                                            Typically triggered after updating flash option bytes via ST-Link
                                            or In-Application Programming (IAP). */

        FMKCPU_RESET_CAUSE_PINRST,        /*!< Reset triggered by the NRST pin (external hardware reset).
                                            This could be a reset button press or an external reset signal. */

        FMKCPU_RESET_CAUSE_BORRST,        /*!< Brown-Out Reset: caused when the supply voltage drops
                                            below a critical threshold, to prevent undefined behavior. */

        FMKCPU_RESET_CAUSE_SFRST,         /*!< Software Reset: triggered via software, for example by calling
                                            `NVIC_SystemReset()` or using internal system mechanisms. */

        FMKCPU_RESET_CAUSE_IWDRST,        /*!< Reset caused by the Independent Watchdog (IWDG),
                                            if the watchdog is not refreshed in time.
                                            Operates independently, even in Stop/Standby modes. */

        FMKCPU_RESET_CAUSE_WWDRST,        /*!< Reset caused by the Window Watchdog (WWDG),
                                            if the watchdog is refreshed too early, too late, or not at all.
                                            It is driven by the system clock. */

        FMKCPU_RESET_CAUSE_LPWRRST,       /*!< Reset due to a Low-Power event (Low-Power Reset),
                                            typically triggered during improper transitions
                                            into or out of Stop/Standby modes. */

