mbarbeau0545/Stm32TemplateProject/src/1_FMK/FMK_CFG/FMKCFG_ConfigFiles/FMKCPU_ConfigPublic.h
        FMKCPU_NVIC_NB,
    } t_eFMKCPU_IRQNType;

    /**
    * @brief Enum for the different request available for DMA service.
    */
    typedef enum
    {
        FMKCPU_DMA_RQSTYPE_ADC1 = 0,               /**< Reference to Bsp Dma Request for ADC1 */
        FMKCPU_DMA_RQSTYPE_ADC2,                     /**< Reference to Bsp Dma Request for ADC2 */
        FMKCPU_DMA_RQSTYPE_ADC3,                     /**< Reference to Bsp Dma Request for ADC3 */
        FMKCPU_DMA_RQSTYPE_ADC4,                     /**< Reference to Bsp Dma Request for ADC4 */
        FMKCPU_DMA_RQSTYPE_ADC5,                     /**< Reference to Bsp Dma Request for ADC5 */
        FMKCPU_DMA_RQSTYPE_UART4_RX,                 /**< Reference to Bsp Dma Request for UART4_RX */
        FMKCPU_DMA_RQSTYPE_UART4_TX,                 /**< Reference to Bsp Dma Request for UART4_TX */
        FMKCPU_DMA_RQSTYPE_USART1_RX,                /**< Reference to Bsp Dma Request for USART1_RX */
        FMKCPU_DMA_RQSTYPE_USART1_TX,                /**< Reference to Bsp Dma Request for USART1_TX */
        FMKCPU_DMA_RQSTYPE_USART2_RX,                /**< Reference to Bsp Dma Request for USART2_RX */
        FMKCPU_DMA_RQSTYPE_USART2_TX,                /**< Reference to Bsp Dma Request for USART2_TX */
        FMKCPU_DMA_RQSTYPE_USART3_RX,                /**< Reference to Bsp Dma Request for USART3_RX */
        FMKCPU_DMA_RQSTYPE_USART3_TX,                /**< Reference to Bsp Dma Request for USART3_TX */
        FMKCPU_DMA_RQSTYPE_TIM8_CH1,                 /**< Reference to Bsp Dma Request for TIM8_CH1 */
    
        FMKCPU_DMA_RQSTYPE_NB,
    } t_eFMKCPU_DmaRqst;

    /**
    * @brief Enum for Number of Dma.
    */
    typedef enum
    {
        FMKCPU_DMA_CTRL_1 = 0,                  /**< Reference to DMA 1 */
        FMKCPU_DMA_CTRL_2,                        /**< Reference to DMA 2 */
    
        FMKCPU_DMA_CTRL_NB,
    } t_eFMKCPU_DmaController;

    /**
    * @brief Enum for number of channel in DMA.
    */
    typedef enum
    {
        FMKCPU_DMA_CHANNEL_1 = 0,                  /**< Reference to Channel 1 */
        FMKCPU_DMA_CHANNEL_2,                        /**< Reference to Channel 2 */
        FMKCPU_DMA_CHANNEL_3,                        /**< Reference to Channel 3 */
        FMKCPU_DMA_CHANNEL_4,                        /**< Reference to Channel 4 */
        FMKCPU_DMA_CHANNEL_5,                        /**< Reference to Channel 5 */
        FMKCPU_DMA_CHANNEL_6,                        /**< Reference to Channel 6 */
        FMKCPU_DMA_CHANNEL_7,                        /**< Reference to Channel 7 */
        FMKCPU_DMA_CHANNEL_8,                        /**< Reference to Channel 8 */
    
        FMKCPU_DMA_CHANNEL_NB,
    } t_eFMKCPU_DmaChnl;

    /**
    * @brief Enum for Number of Dma Multiplexage Controler.
    */
    typedef enum
    {
        FMKCPU_DMA_MUX_1 = 0,                  /**< Reference to DMAMUX 1 */
    
        FMKCPU_DMA_MUX_NB,
    } t_eFMKCPU_DmaMux;

    /* CAUTION : Automatic generated code section for Enum: End */
  
    
    //-----------------------------TYPEDEF TYPES---------------------------//
    /**< Union to centralize Dma Handle TypeDef  */
    typedef union 
    {
        ADC_HandleTypeDef   adcHandle_s;
        USART_HandleTypeDef usartHandle_s;
        UART_HandleTypeDef  uartHandle_s;
        SPI_HandleTypeDef   spiHandle_s;
        TIM_HandleTypeDef   timHandle_s;
    } t_uFMKCPU_DmaHandleType;
#if defined(FMKCPU_STM32_ECU_FAMILY_G4)
    ///@brief Enum for the number of PLL (other than PLL1 ), so for G4 None
    typedef enum 
    {
        FMKCPU_SYS_OSC_PLL_NB = 0U
    } t_eFMKCPU_SysOscPllList;
    typedef struct 
    {
        t_uint32 PLLM_Divider_u32;
        t_uint32 PPLN_Multplier_u32;
        t_uint32 PLLR_Divider_u32;
        t_uint32 PLLQ_Divider_u32;
        t_uint32 PLLP_Divider_u32;
    } t_sFMKCPU_PllOscCfg;

    typedef struct 
    {
        t_uint32 AHB_Divider_u32;
        t_uint32 APB1_Divider_u32;
        t_uint32 APB2_Divider_u32;
    } t_sFMKCPU_SysOscCfg;
#elif defined(FMKCPU_STM32_ECU_FAMILY_H7)
    ///@brief Enum for the number of PLL (other than PLL1 )
    typedef enum 
    {  
        FMKCPU_SYS_OSC_PLL_2 = 0U,
        FMKCPU_SYS_OSC_PLL_3,

        FMKCPU_SYS_OSC_PLL_NB
    } t_eFMKCPU_SysOscPllList;
    typedef struct 
    {
        t_uint32 PLLM_Divider_u32;
        t_uint32 PPLN_Multplier_u32;
        t_uint32 PLLR_Divider_u32;
        t_uint32 PLLQ_Divider_u32;
        t_uint32 PLLP_Divider_u32;
        t_uint32 PLL_RGE_Range_u32;
        t_uint32 PLL_VCOSEL_u32;
        t_uint32 PLL_FRACN_u32;
    } t_sFMKCPU_PllOscCfg;
    typedef struct 
    {
        t_uint32 SysClk_Divider_u32;
        t_uint32 AHB_Divider_u32;
        t_uint32 APB1_Divider_u32;
        t_uint32 APB2_Divider_u32;
        t_uint32 APB3_Divider_u32;
        t_uint32 APB4_Divider_u32;
    } t_sFMKCPU_SysOscCfg;
#endif

    //-----------------------------STRUCT TYPES---------------------------//
    // ********************************************************************
    // *                      Prototypes
    // ********************************************************************
        
    // ********************************************************************
    // *                      Variables
    // ********************************************************************

    //********************************************************************************
    //                      Public functions - Prototyupes
    //********************************************************************************

#endif // FMKCPU_CONFIGPUBLIC_H_INCLUDED           
//************************************************************************************
// End of File
//************************************************************************************         


/**
 *
 *	@brief
 *	@note   
 *
 *
 *	@param[in] 
 *	@param[out]
 *	 
 *
 *
 */
